10/data/attachments/f8e1c0a7668fbdc1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Justin_information_Friend_16118_2</nif:username>
            <nif:friendToBeRequested>soap_friends_143da72d-880f-4d83-8c98-3a676be66471</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>